Repository: 84000/data-translation-memory
Catalog: toh431-v1.tmx
Source language: bo
Languages: en

source: ཟླ་བ་སྙིང་གི་ནང་དུ་སོན། །དེ་ནི་ཉི་མའི་མཐུ་ཡིས་སོ། །དེ་ཉིད་བརྟན་པའི་སྟོབས་དེ་ལས། །
en: One should visualize the moon Together with the sun, in one’s heart. “Through the force of stability in that alone,

source: མི་ཡིས་ཀུན་མཁྱེན་ཐོབ་པར་འགྱུར། །
en: A person will become omniscient.

source: འདས་དང་མ་འོངས་ད་ལྟར་ཡང་། །ཕ་རོལ་སེམས་ནི་ཤེས་འགྱུར་ཏེ། །
en: One will know the past, the future, and the present, And also the thoughts of others.

source: བདག་གི་འདི་ནི་བདེན་པར་སྨྲས། །
en: I am telling the truth.

source: དེ་བཞིན་དེ་ཉིད་སྦྱོར་བ་ཡིས། །
en: “Similarly, through the same method,

source: རྣ་བའི་ནང་དུ་བསྒོམ་བྱས་ན། །ཕྱོགས་རྣམས་ཀུན་ན་གནས་པའི་སྒྲ། །དྲུང་ན་མོ་ནི་ཇི་བཞིན་ཐོས། །
en: One should cultivate the stillness inside the ears. One will be able to hear sounds from every place, As if they were nearby.

source: དེ་བཞིན་མིག་གི་མཐུ་ཡིས་ནི། །
en: “Just so, having empowered the eyes,

source: འཇིག་རྟེན་གསུམ་པོ་མཐོང་བར་བྱེད། །
en: One will see far into the triple universe.

source: དེ་བཞིན་སྣ་ཡིས་བསྣམས་པས་ཀྱང་། །
en: Similarly, by focusing on the nose,

source: དྲི་རྣམས་ཐམས་ཅད་ཤེས་པར་འགྱུར། །
en: One will be able to perceive all smells.

source: དེ་བཞིན་ལྕེ་ཡིས་མྱངས་པས་ཀྱང་། །
en: “Focusing, likewise, on the tongue,

source: རིང་གནས་རོ་ཡང་རབ་ཏུ་སྐྱེ། །
en: One will perceive distant tastes;

source: དེ་བཞིན་རང་རྟགས་རྩེར་བསམས་པས། །
en: And focusing on the tip of one’s sex organ,

source: དེ་བཞིན་མགོ་ཡི་དབུས་བསམས་པས། །
en: “By focusing, in the same way, in the center of one’s head,

source: ཀུན་གྱི་ནུས་མཐུ་འཕེལ་བར་འགྱུར། །
en: one will increase all one’s abilities.

source: ཞི་དང་རྒྱས་དང་དབང་དང་ནི། །
en: “Pacifying, enriching, and enthralling;

source: དགུག་དང་དེ་བཞིན་གསད་པ་དང་། །
en: Likewise summoning, killing,

source: བསྐྲད་དང་ཐམས་ཅད་ཤིན་ཏུ་བསྒོམ། །དེ་ཉིད་གང་བསྒོམས་རབ་ཏུ་འགྲུབ། །
en: And expelling—anything at all Will one accomplish through meditation alone.

source: ཀུ་མ་བྷ་ག་སོགས་རབ་སྦྱོར་བས། །ལྟ་སྟངས་བཞི་པོ་དང་སྦྱོར་བྱ། །
en: “One should combine the practice of kumbhaka and so forth With the four gazes:

source: གཡོན་དུ་ལྟ་བའི་ལྟ་སྟངས་ཀྱིས། །བུམ་པ་ཅན་གྱི་དབང་དུ་བྱེད། །
en: Leftward gaze combined with kumbhaka Should effect enthralling.

source: པཱུར་ཀ་ནི་ངེས་སྦྱོར་བས། །གཡས་ཀྱི་དགུག་པར་ཤེས་པར་བྱ། །
en: “Rightward gaze, known as one that pulls in , Should be combined with pūraka.

source: གང་ཞིག་དཔྲལ་གནས་ལྟ་སྟངས་ཀྱིས། །དེ་ནི་རེ་ཙག་ཡིས་གསད།
en: A gaze that rests on the forehead— The killing one —should be combined with recaka.

source: སྣ་རྩེར་གནས་ཉིད་ལྟ་སྟངས་ཀྱིས། །
en: “A gaze that rests on the tip of the nose—

source: ནས་ཀྱི་མེ་ཏོག་ཀུ་མ་བྷ་ཀ། །
en: When doing kumbhaka, one gazes at a distant flower;

source: སྣ་ཧཱི་པྲྀཀྵ་པཱུར་ཀ། །
en: When doing pūraka, one gazes at a bush of common milk hedge.

source: རླན་བཅས་ཤིང་ནི་རེ་ཙ་ཀ། །
en: “When doing recaka, one gazes at a resinous tree;

source: མིག་དེ་ཡང་ནི་སྟམ་བྷ་ག། །
en: When doing stambhaka, one gazes at swaying grass.

source: ཀུན་གྱི་ལྟ་སྟངས་ངེས་སྦྱོར་ལས། །ཟླ་བ་དྲུག་ཏུ་བསམ་པར་བྱ། །
en: One should allow six months for this practice of each In combination with the respective previously described gaze.

source: ཀུན་གྱི་ནུས་པ་དང་ལྡན་པར།
en: “Possessed of all abilities,

source: སེམས་ནི་འགོག་པས་འགྲུབ་པར་འགྱུར། །
en: one will be successful If one can arrest the movements of the mind.

source: སེམས་ནི་འགགས་པས་རླུང་འགག་གོ། །
en: By arresting the mind, prāṇa is arrested;

source: རླུང་འགགས་པས་ཀྱང་སེམས་ཀྱང་འགག །
en: And by arresting the prāṇa, “The mind will become arrested,

source: རྡོ་རྗེ་པདྨ་མཉམ་སྦྱོར་བས། །ཐབས་དང་ཤེས་རབ་གཅིག་ཏུ་སྦྱོར། །
en: In the single union of wisdom and means , Which is the meeting of the vajra and the lotus.

source: འགོག་པའི་བདེ་ལ་ལོངས་སྤྱོད་པས། །
en: “Through enjoying the pleasure with one’s mind arrested,

source: རྡོ་རྗེ་སེམས་སོགས་སངས་རྒྱས་རྣམས། །
en: The buddhas, Vajrasattva and so forth,

source: བདེ་བྱེད་ལ་སོགས་གྲགས་པ་ཡི། །འཇིག་རྟེན་ལྷ་རྣམས་སྨོས་ཅི་དགོས། །
en: “What need then to mention worldly gods, The celebrated Śiva and so forth.

source: རྒྱུད་རྣམས་ཀུན་དུ་རབ་སྦས་པ། །བདག་གིས་དེ་ཉིད་མི་གཡོ་གཙོ།
en: The lord, the Acala of Reality, Is well concealed by me in all the tantras.

source: གང་ཞིག་དེ་ཉིད་བརྟེན་བྱས་པས། །
en: “Those who have honored him

source: ནམ་མཁའ་ལྟ་བུའི་སངས་རྒྱས་གྱུར། །
en: Have become buddhas, equal to the sky.

source: གང་གཱའི་བྱེ་མ་དང་མཚུངས་པའི། །ཆེན་པོ་རྣམས་ནི་འབྱུང་བར་འགྱུར།
en: Those of great magical powers Will be as numerous as the grains of sand in the Ganges.

source: སངས་རྒྱས་ཡེ་ཤེས་དང་ལྡན་ཉིད། །
en: Endowed with buddha knowledge.

source: དེ་ཕྱིར་རྟག་ཏུ་རྣལ་འབྱོར་པས། །ཁྱབ་བདག་མི་གཡོ་བསམ་པར་བྱ། །
en: Therefore a yogin should always Meditate regularly on Lord Acala.

source: གང་ཞིག་མི་གཡོ་མི་ཤེས་པ། །དེ་ཡི་སྐྱེ་བ་འབྲས་མེད་ཡིན། །
en: “He who does not know Acala Will have a fruitless life.

source: དེ་ཉིད་མེད་ལ་དངོས་གྲུབ་ནི། །
en: For without him, no success,

source: ཕྲ་མོ་ཙམ་ཡང་ཐོབ་པ་མེད།
en: Not even a small one, can be achieved.”

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་གཏུམ་པོ་ཁྲོ་བོ་ཆེན་པོའི་རྒྱུད་ལས་རླུང་གི་རྣལ་འབྱོར་གྱི་རིམ་པར་ཕྱེ་བ་སྟེ་ཉི་ཤུ་རྩ་གཉིས་པའོ།། །།
en: Thus concludes the chapter on prāṇa practices, twenty-second in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: རྐང་མཐིལ་ལྟེ་བར་འབུགས་བྱེད་ན། །
en: “If one feels a prickling sensation in one’s navel when pricking the soles of the feet,

source: ཞག་གསུམ་ནས་ནི་འཆི་བར་འགྱུར། །
en: death will come within three days.

source: རྐང་པའི་མཐིལ་དུ་འབུགས་པ་དང་། །མིག་ཏུ་ཟུག་རྔུས་ཟླ་གསུམ་ན། །
en: If one feels a prickling sensation in one’s eyes when pricking the soles of the feet, it will come within three months.

source: རྐང་པའི་མཐིལ་དུ་འབུགས་པ་དང་། །སྣ་ཡི་ཟུག་རྔུས་ཟླ་གསུམ་ན། །
en: If one feels a prickling sensation in one’s nose when pricking the soles of one’s feet, it will come within three months.

source: བཤང་བ་འཛག་པའི་དུས་སུ་ནི། །
en: at the time of bowel evacuation,

source: མཛོད་སྤུའི་ཟུག་རྔུ་ཡིས་ཉི་མ་གཅིག་ནའོ།
en: between one’s eyebrows, it will come within a day.

source: མཐེའུ་ཆུང་ཐམས་ཅད་མཉམ་དུ་ཟུག་རྔུར་གྱུར་ན་ཟླ་བ་ནའོ། །
en: Similarly if one feels a prickly sensation in all four of the smallest fingers and toes, one will die within a month.

source: མཉམ་དུ་སྙིང་ག་དང་མགྲིན་པར་ཟུག་རྔུར་གྱུར་ན་ཟླ་བ་ཕྱེད་པ་གསུམ་ནའོ། །
en: “Also if one feels a prickly sensation in one’s chest and throat, one will die within three fortnights;

source: རྣ་བའི་རྩ་བ་དང་། སྨིན་མའི་དབུས་དང་། མགོའི་དང་པོ་རྣམས་སུ་ཟུག་རྔུར་གྱུར་ན་ཉི་མ་གཅིག་ནའོ། །
en: If one feels separate prickles at the root of one’s ears, between the eyebrows, and at the front of one’s head, one will die after one day.

source: སྣ་རྩེའི་ཤ་ཞུམ་ན་ཞག་བདུན་ནའོ། །
en: “If the flesh at the tip of the nose starts to sag, one will die within seven days.

source: སྙིང་ག་ཞོམ་ན་ཟླ་བ་ཕྱེད་ནའོ། །
en: If one’s chest becomes hollow, one will die within a fortnight.

source: ལྕེའི་དཀྱིལ་དུ་རི་མོ་ནག་པོ་བྱུང་ན་ཞག་གཉིས་ནའོ། །
en: If a line appears across the center of one’s tongue, one will die within two days.

source: སེན་མོ་ལ་ཁྲག་མ་མཐོང་ན་ཟླ་བ་དྲུག་ནའོ། །
en: If no redness is seen in the fingernails, one will die within six months.

source: སོ་སྐམས་ན་ཟླ་བ་དྲུག་ནའོ། །
en: If one’s teeth dry up, one will die within six months.

source: ཨ་རུ་ཎ་མ་མཐོང་ན་ཟླ་བ་དྲུག་ནའོ། །
en: “If one cannot see the star Arundhatī, one will die within six months.

source: གྲང་མོ་ལ་སོགས་པའི་དུས་ཕྱིན་ཅི་ལོག་པ་ལས་ཐམས་ཅད་དུ་བུག་པར་མཐོང་ན་ཟླ་བ་ཕྱེད་ནའོ། །
en: If one sees, in the cold season and so on, a distorted image with holes everywhere, one will die within a fortnight.

source: ཧ་ཡིག་བརྗོད་པས་གྲང་བ་དང་། ཕུཿཡིག་བརྗོད་པས་དྲོ་བར་གྱུར་ན་ཉི་མ་བཅུ་ནའོ། །
en: If one feels cold after uttering the sound haḥ , and hot after uttering the sound phūḥ , one will die within ten days.

source: ཁྲུས་བྱས་པ་ཙམ་གྱིས་སྙིང་ག་དང་རྐང་བསྒམ་ན།
en: If one’s chest and feet dry up as soon as one has finished bathing,

source: ལུས་ལ་དྲི་ངན་པ་བྱུང་ན་ཞག་གསུམ་ནའོ། །
en: If one’s body becomes malodorous, one will die within three days.

source: དྲི་ཆུ་གཡོན་དུ་འཁོར་ན་ཟླ་བ་དྲུག་ནའོ། །
en: If the stream of one’s urine swirls counterclockwise, one will die within six months.

source: ལྟེ་བ་ཕྱིན་ཅི་ལོག་ན་ཉི་མ་ལྔ་ནའོ། །
en: If one’s navel should become inverted, one will die within five days.

source: སྣའི་རྩེ་མོ་མ་མཐོང་ན་དེ་ཟླ་བ་ལྔ་ནའོ། །
en: If one cannot see the tip of one’s nose, one will die within five months.

source: མིག་སོར་མོས་མནན་པས་འོད་མ་མཐོང་ན་ཉི་མ་བརྒྱ་ནའོ། །
en: If one doesn’t see flashes of light when pressing one’s eyes with one’s fingers, one will die within one hundred days.

source: ཕ་རོལ་གྱི་མིག་ལ་གཟུགས་བརྙན་མ་མཐོང་ན་ཟླ་བ་ཕྱེད་ནའོ། །
en: If one cannot see one’s own reflection in another person’s eyes, one will die within a fortnight.

source: དེ་ཉིད་ཤེས་ཕྱི་རང་ཆིབ་སླུ་དང་། །འཇིག་རྟེན་ཕ་རོལ་བསམ་པར་བྱ།
en: “Knowing these signs, one should contemplate deceiving death and think of the hereafter.”

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་གཏུམ་པོ་ཁྲོ་བོ་ཆེན་པོའི་རྒྱུད་ལས་འཆི་ལྟས་ཀྱི་མཚན་ཉིད་རིམ་པར་ཕྱེ་བ་སྟེ་ཉི་ཤུ་རྩ་གསུམ་པའོ།། །།
en: This concludes the chapter on the signs of death, twenty-third in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: ཕ་དང་མ་ཡི་མཉམ་སྦྱོར་ལས། །
en: “After the mother and the father unite,

source: འབྱུང་ལྔའི་བདག་ཅན་ཟླ་བ་དང་། །
en: The moon has the nature of the five elements and

source: འབྱུང་བ་ལྔ་ཡི་བདག་ཉིད་ཅན། །ཉི་མའི་སྦྱོར་བ་འཛོམ་པ་ལས།
en: The sun has the nature of the five elements. Through the meeting of these two,

source: སེམས་ཅན་སྐྱེ་བར་འགྱུར། །
en: “A being is born

source: ཐབས་དང་ཤེས་རབ་བདག་ཉིད་ཅན།
en: One of the nature of wisdom and means

source: རུས་ཚིགས་ཟླ་བ་ལས། །ཉི་མས་ཤ་ལ་སོགས་པར་འགྱུར། །
en: Bones and sinews will be formed from the moon; And flesh, and other matter, from the sun.

source: བདག་ཉིད་སྟོང་པའི་ལུས་གྱུར་ལ། །
en: “It becomes a body, which is devoid of self,

source: སེམས་ཅན་རྣམས་ནི་ལས་ཀྱིས་སྤྲུལ། །
en: And is produced by the beings’ karma.

source: སྒྱུ་མ་ལྟ་བུའི་རང་བཞིན་འདི། །
en: By nature it is like a magical display,

source: དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་དང་། །
en: Similar to a city of gandharvas.

source: དབང་པོའི་གཞུ་དང་མཚུངས་པ་འདི། །
en: “It is the same as a rainbow

source: ཆུ་ནང་ཟླ་བ་ལྟ་བུར་འདོད།
en: and said to be like the moon reflected in water.”

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་གཏུམ་པོ་ཁྲོ་བོ་ཆེན་པོའི་རྒྱུད་ལས་ལུས་ཀྱི་རང་བཞིན་གྱི་རིམ་པར་ཕྱེ་བ་སྟེ་ཉི་ཤུ་རྩ་བཞི་པའོ།། །།
en: This concludes the chapter on the nature of the body, twenty-fourth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: ཤེས་རབ་ཕ་རོལ་ཕྱིན་འབྱུང་བ། །
en: the arising of the perfection of wisdom

source: མགོན་པོ་བདག་ལ་བཀའ་དྲིན་མཛོད། །
en: Please grant me this favor, my lord;

source: ཤིན་ཏུ་རྒྱས་མིན་མདོར་བསྡུས་པས། །
en: Speak briefly, without elaborating too much.”

source: ལྷ་མོ་སེམས་དཔའི་སྐྱིལ་ཀྲུང་མཛད། །
en: The goddess who sits in sattvaparyaṅka posture,

source: བཅུ་དྲུག་ལོ་ཡི་གཟུགས་ཅན་མ། །
en: With the body of a sixteen-year-old.

source: སྐུ་མདོག་སྔོན་མོ་སྐལ་ཆེན་མ། །
en: “She is blue, greatly exalted in merit,

source: མི་བསྐྱོད་པ་ཡིས་དབུ་ལ་བརྒྱན། །
en: Crowned with Akṣobhya.

source: ཕྱག་གཡས་པདྨ་དམར་པོ་བསྣམས། །
en: In her raised right hand, she holds a red lotus;

source: གཡོན་པའི་ཕྱག་ནི་རོལ་པའི་སྟབས། །
en: her left hand, which is in the playful attitude,

source: པདྨ་ཟླ་བའི་སྟེང་དུ་བཞུགས། །
en: She sits on a moon that rests on a lotus,

source: ལྷན་སྐྱེས་མི་གཡོའི་ཏིང་འཛིན་གནས། །ལྷ་མོ་འདི་ནི་བསྒོམ་པར་གྱིས། །
en: “One should meditate on this goddess While focused on the innate Acala.

source: སྣ་ཚོགས་རྡོ་རྗེའི་རྣལ་འབྱོར་མ། །
en: As for the yoginī Viśvavajrī,

source: ཧཱུྃ་ཡིག་ཡེ་ཤེས་ལས་བྱུང་བའི། །
en: Arisen from the gnosis of the syllable hūṁ

source: དངོས་གྲུབ་ངེས་པར་ཐོབ་པར་འགྱུར། །
en: One will surely attain success.

source: ཡང་ན་དྷཱིཿཡིག་ལས་བྱུང་བའི། །ཁ་དོག་དཀར་པོ་བསྒོམ་པར་བྱ། །
en: Alternatively one should meditate on the white Sarasvatī, Arisen from the syllable dhīḥ

source: དམར་པོ་ཀུ་རུ་ཀུལྤེ་ཀཱ། །
en: Or the red Kurukullā—

source: ལྷ་མོ་དབུ་རྒྱན་འོད་དཔག་མེད། །ཧྲི་ཡིག་ཡེ་ཤེས་ལས་བྱུང་མ། །
en: “The goddess crowned with Amitābha And arisen from the gnosis of the syllable hrīṁ

source: སྒྲོལ་མ་སྐུ་མདོག་ལྗང་གུ་ནི། །
en: Or the green Tārā,

source: ཏྃ་ཡིག་ཡེ་ཤེས་ལས་བྱུང་བའི། །
en: Arisen from the gnosis of the syllable tāṁ

source: དོན་ཡོད་གྲུབ་པའི་དབུ་བརྒྱན་མ།
en: “Crowned with Amoghasiddhi.

source: སེམས་དཔའི་སྐྱིལ་ཀྲུང་གིས་གནས་ནས། །
en: Should sit in the sattvaparyaṅka posture,

source: ཞི་བའི་གཟུགས་ཀྱིས་ཡང་དག་ཞུགས། །
en: Maintaining a gentle frame of mind.

source: དཔལ་ལྡན་རལ་གྲི་ཞགས་པ་བསྣམས། །
en: “Holding a sword and a noose, full of splendor,

source: རང་རིགས་ཡང་ན་གཞན་རིགས་ཀྱིས། །བུ་མོ་བཟུང་ནས་བསྒོམ་པར་བྱ། །
en: Should find a girl from his own spiritual family or that of another, And meditate while holding her.

source: ཕྱག་རྒྱ་འདི་ཡིས་རྣལ་འབྱོར་པས། །ཐེ་ཚོམ་མེད་པར་དངོས་གྲུབ་འགྱུར། །
en: “Through this, there is no doubt That a yogin will succeed by means of a consort.

source: ཡང་ནས་སོགས་ལས་འགྱིས་པའི། །གཟུགས་བརྙན་བྱས་ནས་བསྒྲུབ་པར་བྱ། །
en: Alternatively one should make a lifelike effigy And do practice with ‘her’—made of clay and so on.

source: རྩེ་གཅིག་ཡིད་ཀྱིས་བཟླས་པར་བྱ། །དེ་ལ་བཟླས་པའི་སྔགས་ནི་འདི།
en: One should recite the mantra, with one-pointed mind. “And these are the respective mantras to be recited:

source: ཨོྃ་བི་ཤྭ་བཛྲཱི་ཨཱ་གཙྪ་ཨཱ་གཙྪ་ཧཱུྃ་སྭཱ་ཧཱ།
en: Oṁ , Viśvavajrī, come, come! Hūṁ svāhā

source: ཨོྃ་བཛྲ་སར་སྭ་ཏཱི་ཨཱ་གཙྪ་ཨཱ་གཙྪ་དྷཱིཿསྭཱ་ཧཱ།
en: Oṁ , Vajrasarasvatī, come, come! Dhīḥ svāhā

source: ཨོྃ་བཛྲ་དྷཱ་ཏྭི་ཤྭ་རཱི་ཨཱ་གཙྪ་ཨཱ་གཙྪ་བྃ་སྭཱ་ཧཱ།
en: Oṁ , Vajra­dhātvīśvarī, come, come! Vaṁ svāhā

source: ཨོྃ་ཀུ་རུ་ཀུལླེ་ཨཱ་གཙྪ་ཨཱ་གཙྪ་ཧྲཱིཾ་སྭཱ་ཧཱ།
en: Oṁ , Kurukullā, come, come! Hrīṁ svāhā

source: ཨོྃ་ཏཱ་རེ་ཨཱ་གཙྪ་ཨཱ་གཙྪ་ཏཱྃ་སྭཱ་ཧཱ།
en: Oṁ , Tārā, come, come! Tāṁ svāhā

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །དཔའ་བོ་གཅིག་པའི་དཀྱིལ་འཁོར་ལ། །
en: “Now I will teach The maṇḍala of the Sole Hero.

source: རྟ་བབས་བཞི་ཡིས་བརྒྱན་པ་ལ། །
en: And is adorned with four gateways.

source: ཁ་དོག་སེར་པོར་བྱས་པ་ལ། །
en: “It should be colored yellow,

source: དབུས་སུ་པདྨ་འདབ་བཞི་ལ། །
en: With a four-petaled lotus in the center.

source: དེ་ཡང་མེ་ཡི་འདབ་མ་དཀར། །
en: Its southeastern petal should be white,

source: བདེན་བྲལ་དུ་ནི་དམར་པོར་མཚུངས། །
en: The southwestern red,

source: རླུང་དུ་ཁ་དོག་སེར་པོ་སྟེ། །
en: “The northwestern yellow,

source: དབང་ལྡན་མཚམས་སུ་ལྗང་གུའོ།
en: And the northeastern green.

source: དབུས་སུ་ཁ་དོག་ནག་པོ་སྟེ། །དེ་ལ་མི་གཡོ་བརྟག་པར་བྱ། །
en: In the center, one should draw Acala of black color,

source: ཡང་ན་ཉི་མའི་སྟེང་གནས་པའི། །
en: “Situated, optionally, on a sun disk.

source: དཀར་པོ་སེར་པོ་དམར་པོའམ། །ལྗང་གུ་སངས་རྒྱས་ལྔ་རྣམས་ཀྱི། །སྐུ་རུ་རྣམ་པར་བསམ་པར་བྱ། །
en: He could be white, yellow, red, or green. One should imagine him To be identical in nature with the five buddhas.

source: མེ་ཡི་མཚམས་སུ་སྤྱན་མ་སྟེ། །
en: “In the southeast corner is Locanā.

source: གཡོན་དང་གཡས་པའི་ཕྱག་དག་གིས། །ཟླ་བ་མྱ་ངན་མེད་ཤིང་བསྣམས། །
en: She holds, in her left and right hands, A moon and an aśoka twig,

source: སྟོན་ཀའི་ཟླ་བའི་འོད་དང་མཚུངས། །
en: And has the radiance of the autumn moon.

source: བདེན་བྲལ་ལྷ་མོ་གོས་དཀར་མོ། །
en: “In the southwest is the supreme goddess Pāṇḍarā,

source: རླུང་གི་མཚམས་སུ་མཱ་མ་ཀཱི། །
en: In the northwest corner Is Māmakī

source: བུམ་པ་འབྲས་ཀྱི་སྙེ་མ་ཕྱག །
en: “With a vase and a bunch of rice twigs in her hands.

source: དབང་ལྡན་མཚམས་སུ་སྒྲོལ་མ་སྟེ། །ལྗང་གུ་གཡས་པ་མཆོག་སྦྱིན་དང་། །
en: In the northeast corner is green Tārā, Making a boon-granting gesture with her right hand

source: གཡོན་པ་ཨུཏྤ་ལ་སྔོན་པོ་བསྣམས། །
en: And holding a blue lotus in her left.

source: དེ་རྣམས་ཟླ་བའི་གདན་ལ་ནི། །ཐམས་ཅད་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས། །
en: “All of them have a seat of a moon disk And sit in the ardhaparyaṅka posture.

source: ཤར་སྒོ་བརྒྱ་བྱིན་གདན་ལ་ནི། །འདོད་ཆགས་རྡོ་རྗེ་དགོད་པར་བྱ། །
en: One should place Passion Vajrī at the eastern gate,

source: རལ་གྲི་ཐོད་བསྣམས་སྐུ་མདོག་དམར། །
en: “She holds a sword and a skull and is of red complexion.

source: ལྷོ་རུ་གཤིན་རྗེའི་གདན་ལ་ནི། །ཞེ་སྡང་རྡོ་རྗེ་སྐུ་མདོག་ནག །གྲི་གུག་དང་ནི་སྡིགས་མཛུབ་ཕྱག །
en: In the south, one should place the blue Hatred Vajrī; Holding a kartri knife, she makes a threatening gesture And stands on a seat fashioned from Yama.

source: སྡིགས་མཛུབ་ཨ་ཤོ་ཀ་བསྣམས་པ། །
en: With a threatening gesture, Holding an aśoka twig,

source: ཁྲོ་ཞིང་སྐྲ་ནི་གྱེན་དུ་བརྗེས། །
en: All are angry and have their hair hanging loose.

source: ཁ་དོག་སེར་པོར་མཚུངས་པ་ཡི། །མཚམས་བཞི་ལ་ནི་བུམ་པ་དགོད། །
en: “The four yellow vases Should be placed in the corners.

source: རྣལ་འབྱོར་མ་བརྒྱད་དང་ལྡན་པ། །འདི་ནི་བསྒོམས་པ་ཙམ་གྱིས་ནི། །
en: By merely visualizing him, One is provided with the company of eight yoginīs.

source: འཇིག་རྟེན་གསུམ་གནས་བུད་མེད་ཀྱི། །བདག་པོ་དབང་ཕྱུག་དམ་པར་བཅས། །
en: “Abiding in the three realms, one becomes The husband of all women, the supreme lord.

source: དེ་ནས་གཞན་ཡང་རབ་བཤད་བྱ། །གཏུམ་པོ་ཁྲོ་བོས་སྒོམ་པ་ནི། །
en: “Now I will teach another meditation on Caṇḍa­mahā­roṣaṇa.

source: སྣ་ཚོགས་པདྨའི་སྟེང་དུ་ལྷ། །གཏུམ་པོ་ཁྲོ་བོ་བརྟག་པར་བྱ། །
en: “In the center of a multicolored lotus, One should visualize the lord Caṇḍa­mahā­roṣaṇa.

source: རཱ་མ་དེ་བ་ཁ་དོག་དམར། །
en: the red Rāmadeva;

source: འདོད་པའི་ལྷ་སྟེ་ཁ་དོག་སེར། །
en: “The yellow Kāmadeva.

source: མ་ཧཱི་ཎི་ཞེས་ཁ་དོག་ལྗང་།
en: The green vetāla by name of Māhilla

source: གྲི་གུག་ཐོད་པའི་ལག །
en: “They have a kartri knife and a skull cup in their hands;

source: ལྷ་མོ་པར་ཎ་ཤ་བ་རི། །བཅོམ་ལྡན་འདས་ཀྱི་ནུབ་ཕྱོགས་གནས། །
en: To the west of the lord Is the goddess Parṇaśāvarī.

source: འདི་ཉིད་བསམ་གཏན་སྦྱོར་བ་ཡིས། །
en: “By meditating on just that and

source: ཉ་སོགས་བསྲེགས་པས་མཆོད་པར་བྱ། །
en: offering grilled fish and so on,

source: གཡོན་པའི་ཕྱག་ན་པདྨ་དཀར། །
en: holding a white lotus in her left hand.

source: གཏུམ་པོ་ཁྲོ་བོ་སྔོན་པོའམ། །
en: Caṇḍa­mahā­roṣaṇa, for his part, should be visualized as blue,

source: རྣལ་འབྱོར་བསྒོམ་པ་ཡོངས་བསྟན་པས།
en: “The yogin, adept in meditation,

source: སྐད་ཅིག་གིས་ནི་འགྲུབ་པར་འགྱུར། །
en: Will succeed right at that time.

source: དེ་ལྟར་མི་གཡོ་དཀར་པོ་སོགས། །འབད་པ་དྲག་པོས་སྒོམ་བྱེད་ན། །
en: In this way, one should meditate on The White Acala and so forth with firm application.

source: སེམས་ནི་རྩེ་གཅིག་མཉམ་བཞག་པས། །ས་བོན་དང་བྲལ་ཉིད་ཀྱང་བསྒོམ། །
en: “Even without the seed syllable, one should meditate With one’s mind focused one-pointedly.

source: ཟ་དང་འཐུང་དང་ཉལ་བ་དང་། །
en: Whether drinking, eating, sleeping,

source: འདུག་དང་འགྲོ་དང་འཆག་པར་ཡང་། །
en: Standing, walking, or running.

source: གནས་སྐབས་ཀུན་དུ་རྣལ་འབྱོར་པས། །ལྷ་ཡི་རྣམ་པར་བསྒོམ་པར་བྱ།
en: “In whatever situation he may be, The yogin should visualize the divine form.

source: ཡང་ན་བདེ་བ་འབའ་ཞིག་ནི། །ཕན་ཚུན་བདེ་བའི་རྣལ་འབྱོར་མ། །
en: Or he should cultivate only bliss, Savored while coupling with the yoginī.

source: ཇི་སྲིད་རབ་ཏུ་གསལ་གྱུར་པ། །དེ་སྲིད་བར་དུ་འབད་པས་བསྒོམ། །
en: “One should meditate deeply Until one attains mastery.

source: རབ་གསལ་གྱུར་ན་རྣལ་འབྱོར་པའི། །ཕྱག་རྒྱ་ཆེན་པོའི་དངོས་གྲུབ་བོ།
en: When mastery is attained, The yogin will succeed through mahāmudra.”

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་གཏུམ་པོ་ཁྲོ་བོ་ཆེན་པོའི་རྒྱུད་ལས་ལྷ་མོ་རྣམས་ཀྱི་སྒྲུབ་ཐབས་ཀྱི་རིམ་པར་ཕྱེ་བ་སྟེ་ཉི་ཤུ་རྩ་ལྔ་པའོ།། །།
en: This concludes the chapter on deity practice, twenty-fifth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: བཅོམ་ལྡན་འདས་དཔལ་རྡོ་རྗེ་སེམས་དཔས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Lord Vajrasattva spoke this tantra, and

source: རྣལ་འབྱོར་དང་རྣལ་འབྱོར་མའི་ཚོགས་རྣམས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའོ། །
en: the assemblies of yogins and yoginīs rejoiced at his words.

source: དཔལ་གཏུམ་པོ་ཁྲོ་བོ་ཆེན་པོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་རྫོགས་སོ།།
en: This completes the tantra of Caṇḍa­mahā­roṣaṇa called “ The Sole Hero
